# StructuralSectionCSlopedFlange Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionCSlopedFlange Class
Members See Also
---
Defines parameters for C-channel Sloped Flange structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class StructuralSectionCSlopedFlange : StructuralSectionGeneralU
```

Visual Basic
---
```text
Public Class StructuralSectionCSlopedFlange _
	Inherits StructuralSectionGeneralU
```

Visual C++
---
```text
public ref class StructuralSectionCSlopedFlange : public StructuralSectionGeneralU
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionHotRolled Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralU Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionCSlopedFlange
# See Also
StructuralSectionCSlopedFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace